GopalSaraf/Practicals/PSDL/include/proc/pic16f18074.h
#define                                 ANSELE1_bit         _BIT_ACCESS(ANSELE,1)
// ANSELE<ANSELE2>
extern volatile __bit                   ANSELE2             __at(0xF5A2);	// @ (0x1EB4 * 8 + 2)
#define                                 ANSELE2_bit         _BIT_ACCESS(ANSELE,2)
// ADSTAT<AOV>
extern volatile __bit                   AOV                 __at(0xE957);	// @ (0x1D2A * 8 + 7)
#define                                 AOV_bit             _BIT_ACCESS(ADSTAT,7)
// CWG1AS1<AS0E>
extern volatile __bit                   AS0E                __at(0x2898);	// @ (0x513 * 8 + 0)
#define                                 AS0E_bit            _BIT_ACCESS(CWG1AS1,0)
// CWG1AS1<AS1E>
extern volatile __bit                   AS1E                __at(0x2899);	// @ (0x513 * 8 + 1)
#define                                 AS1E_bit            _BIT_ACCESS(CWG1AS1,1)
// CWG1AS1<AS2E>
extern volatile __bit                   AS2E                __at(0x289A);	// @ (0x513 * 8 + 2)
#define                                 AS2E_bit            _BIT_ACCESS(CWG1AS1,2)
// CWG1AS1<AS3E>
extern volatile __bit                   AS3E                __at(0x289B);	// @ (0x513 * 8 + 3)
#define                                 AS3E_bit            _BIT_ACCESS(CWG1AS1,3)
// CWG1AS1<AS4E>
extern volatile __bit                   AS4E                __at(0x289C);	// @ (0x513 * 8 + 4)
#define                                 AS4E_bit            _BIT_ACCESS(CWG1AS1,4)
// CWG1AS1<AS5E>
extern volatile __bit                   AS5E                __at(0x289D);	// @ (0x513 * 8 + 5)
#define                                 AS5E_bit            _BIT_ACCESS(CWG1AS1,5)
// CWG1AS1<AS6E>
extern volatile __bit                   AS6E                __at(0x289E);	// @ (0x513 * 8 + 6)
#define                                 AS6E_bit            _BIT_ACCESS(CWG1AS1,6)
// CWG1AS1<AS7E>
extern volatile __bit                   AS7E                __at(0x289F);	// @ (0x513 * 8 + 7)
#define                                 AS7E_bit            _BIT_ACCESS(CWG1AS1,7)
// T0CON1<ASYNC>
extern volatile __bit                   ASYNC               __at(0xCFC);	// @ (0x19F * 8 + 4)
#define                                 ASYNC_bit           _BIT_ACCESS(T0CON1,4)
// PIE3<BCL1IE>
extern volatile __bit                   BCL1IE              __at(0x4CF);	// @ (0x99 * 8 + 7)
#define                                 BCL1IE_bit          _BIT_ACCESS(PIE3,7)
// PIR3<BCL1IF>
extern volatile __bit                   BCL1IF              __at(0x47F);	// @ (0x8F * 8 + 7)
#define                                 BCL1IF_bit          _BIT_ACCESS(PIR3,7)
// PIE4<BCL2IE>
extern volatile __bit                   BCL2IE              __at(0x4D1);	// @ (0x9A * 8 + 1)
#define                                 BCL2IE_bit          _BIT_ACCESS(PIE4,1)
// PIR4<BCL2IF>
extern volatile __bit                   BCL2IF              __at(0x481);	// @ (0x90 * 8 + 1)
#define                                 BCL2IF_bit          _BIT_ACCESS(PIR4,1)
// SSP1STAT<BF1>
extern volatile __bit                   BF1                 __at(0x3478);	// @ (0x68F * 8 + 0)
#define                                 BF1_bit             _BIT_ACCESS(SSP1STAT,0)
// SSP2STAT<BF2>
extern volatile __bit                   BF2                 __at(0x34C8);	// @ (0x699 * 8 + 0)
#define                                 BF2_bit             _BIT_ACCESS(SSP2STAT,0)
// BORCON<BORRDY>
extern volatile __bit                   BORRDY              __at(0xC68);	// @ (0x18D * 8 + 0)
#define                                 BORRDY_bit          _BIT_ACCESS(BORCON,0)
// BSR<BSR0>
extern volatile __bit                   BSR0                __at(0x40);	// @ (0x8 * 8 + 0)
#define                                 BSR0_bit            _BIT_ACCESS(BSR,0)
// BSR<BSR1>
extern volatile __bit                   BSR1                __at(0x41);	// @ (0x8 * 8 + 1)
#define                                 BSR1_bit            _BIT_ACCESS(BSR,1)
// BSR<BSR2>
extern volatile __bit                   BSR2                __at(0x42);	// @ (0x8 * 8 + 2)
#define                                 BSR2_bit            _BIT_ACCESS(BSR,2)
// BSR<BSR3>
extern volatile __bit                   BSR3                __at(0x43);	// @ (0x8 * 8 + 3)
#define                                 BSR3_bit            _BIT_ACCESS(BSR,3)
// BSR<BSR4>
extern volatile __bit                   BSR4                __at(0x44);	// @ (0x8 * 8 + 4)
#define                                 BSR4_bit            _BIT_ACCESS(BSR,4)
// BSR<BSR5>
extern volatile __bit                   BSR5                __at(0x45);	// @ (0x8 * 8 + 5)
#define                                 BSR5_bit            _BIT_ACCESS(BSR,5)
// CM1CON0<C1EN>
extern volatile __bit                   C1EN                __at(0x8467);	// @ (0x108C * 8 + 7)
#define                                 C1EN_bit            _BIT_ACCESS(CM1CON0,7)
// CM1CON0<C1HYS>
extern volatile __bit                   C1HYS               __at(0x8461);	// @ (0x108C * 8 + 1)
#define                                 C1HYS_bit           _BIT_ACCESS(CM1CON0,1)
// CM1CON1<C1INTN>
extern volatile __bit                   C1INTN              __at(0x8468);	// @ (0x108D * 8 + 0)
#define                                 C1INTN_bit          _BIT_ACCESS(CM1CON1,0)
// CM1CON1<C1INTP>
extern volatile __bit                   C1INTP              __at(0x8469);	// @ (0x108D * 8 + 1)
#define                                 C1INTP_bit          _BIT_ACCESS(CM1CON1,1)
// CM1NCH<C1NCH0>
extern volatile __bit                   C1NCH0              __at(0x8470);	// @ (0x108E * 8 + 0)
#define                                 C1NCH0_bit          _BIT_ACCESS(CM1NCH,0)
// CM1NCH<C1NCH1>
extern volatile __bit                   C1NCH1              __at(0x8471);	// @ (0x108E * 8 + 1)
#define                                 C1NCH1_bit          _BIT_ACCESS(CM1NCH,1)
// CM1NCH<C1NCH2>
extern volatile __bit                   C1NCH2              __at(0x8472);	// @ (0x108E * 8 + 2)
#define                                 C1NCH2_bit          _BIT_ACCESS(CM1NCH,2)
// CM1PCH<C1PCH0>
extern volatile __bit                   C1PCH0              __at(0x8478);	// @ (0x108F * 8 + 0)
#define                                 C1PCH0_bit          _BIT_ACCESS(CM1PCH,0)
// CM1PCH<C1PCH1>
extern volatile __bit                   C1PCH1              __at(0x8479);	// @ (0x108F * 8 + 1)
#define                                 C1PCH1_bit          _BIT_ACCESS(CM1PCH,1)
// CM1PCH<C1PCH2>
extern volatile __bit                   C1PCH2              __at(0x847A);	// @ (0x108F * 8 + 2)
#define                                 C1PCH2_bit          _BIT_ACCESS(CM1PCH,2)
// CM1CON0<C1POL>
extern volatile __bit                   C1POL               __at(0x8464);	// @ (0x108C * 8 + 4)
#define                                 C1POL_bit           _BIT_ACCESS(CM1CON0,4)
// CM1CON0<C1SYNC>
extern volatile __bit                   C1SYNC              __at(0x8460);	// @ (0x108C * 8 + 0)
#define                                 C1SYNC_bit          _BIT_ACCESS(CM1CON0,0)
// TMR1L<CAL01>
extern volatile __bit                   CAL01               __at(0x1460);	// @ (0x28C * 8 + 0)
#define                                 CAL01_bit           _BIT_ACCESS(TMR1L,0)
// TMR3L<CAL03>
extern volatile __bit                   CAL03               __at(0x1490);	// @ (0x292 * 8 + 0)
#define                                 CAL03_bit           _BIT_ACCESS(TMR3L,0)
// TMR1L<CAL11>
extern volatile __bit                   CAL11               __at(0x1461);	// @ (0x28C * 8 + 1)
#define                                 CAL11_bit           _BIT_ACCESS(TMR1L,1)
// TMR3L<CAL13>
extern volatile __bit                   CAL13               __at(0x1491);	// @ (0x292 * 8 + 1)
#define                                 CAL13_bit           _BIT_ACCESS(TMR3L,1)
// TMR1L<CAL21>
extern volatile __bit                   CAL21               __at(0x1462);	// @ (0x28C * 8 + 2)
#define                                 CAL21_bit           _BIT_ACCESS(TMR1L,2)
// TMR3L<CAL23>
extern volatile __bit                   CAL23               __at(0x1492);	// @ (0x292 * 8 + 2)
#define                                 CAL23_bit           _BIT_ACCESS(TMR3L,2)
// TMR1L<CAL31>
extern volatile __bit                   CAL31               __at(0x1463);	// @ (0x28C * 8 + 3)
#define                                 CAL31_bit           _BIT_ACCESS(TMR1L,3)
// TMR3L<CAL33>
extern volatile __bit                   CAL33               __at(0x1493);	// @ (0x292 * 8 + 3)
#define                                 CAL33_bit           _BIT_ACCESS(TMR3L,3)
// TMR1L<CAL41>
extern volatile __bit                   CAL41               __at(0x1464);	// @ (0x28C * 8 + 4)
#define                                 CAL41_bit           _BIT_ACCESS(TMR1L,4)
// TMR3L<CAL43>
extern volatile __bit                   CAL43               __at(0x1494);	// @ (0x292 * 8 + 4)
#define                                 CAL43_bit           _BIT_ACCESS(TMR3L,4)
// TMR1L<CAL51>
extern volatile __bit                   CAL51               __at(0x1465);	// @ (0x28C * 8 + 5)
#define                                 CAL51_bit           _BIT_ACCESS(TMR1L,5)
// TMR3L<CAL53>
extern volatile __bit                   CAL53               __at(0x1495);	// @ (0x292 * 8 + 5)
#define                                 CAL53_bit           _BIT_ACCESS(TMR3L,5)
// TMR1L<CAL61>
extern volatile __bit                   CAL61               __at(0x1466);	// @ (0x28C * 8 + 6)
#define                                 CAL61_bit           _BIT_ACCESS(TMR1L,6)
// TMR3L<CAL63>
extern volatile __bit                   CAL63               __at(0x1496);	// @ (0x292 * 8 + 6)
#define                                 CAL63_bit           _BIT_ACCESS(TMR3L,6)
// TMR1L<CAL71>
extern volatile __bit                   CAL71               __at(0x1467);	// @ (0x28C * 8 + 7)
#define                                 CAL71_bit           _BIT_ACCESS(TMR1L,7)
// TMR3L<CAL73>
extern volatile __bit                   CAL73               __at(0x1497);	// @ (0x292 * 8 + 7)
#define                                 CAL73_bit           _BIT_ACCESS(TMR3L,7)
// ADCON3<CALC0>
extern volatile __bit                   CALC0               __at(0xE94C);	// @ (0x1D29 * 8 + 4)
#define                                 CALC0_bit           _BIT_ACCESS(ADCON3,4)
// ADCON3<CALC1>
extern volatile __bit                   CALC1               __at(0xE94D);	// @ (0x1D29 * 8 + 5)
#define                                 CALC1_bit           _BIT_ACCESS(ADCON3,5)
// ADCON3<CALC2>
extern volatile __bit                   CALC2               __at(0xE94E);	// @ (0x1D29 * 8 + 6)
#define                                 CALC2_bit           _BIT_ACCESS(ADCON3,6)
// STATUS<CARRY>
extern volatile __bit                   CARRY               __at(0x18);	// @ (0x3 * 8 + 0)
#define                                 CARRY_bit           _BIT_ACCESS(STATUS,0)
// CCP1CAP<CCP1CTS0>
extern volatile __bit                   CCP1CTS0            __at(0x1C78);	// @ (0x38F * 8 + 0)
#define                                 CCP1CTS0_bit        _BIT_ACCESS(CCP1CAP,0)
// CCP1CAP<CCP1CTS1>
extern volatile __bit                   CCP1CTS1            __at(0x1C79);	// @ (0x38F * 8 + 1)
#define                                 CCP1CTS1_bit        _BIT_ACCESS(CCP1CAP,1)
// CCP1CAP<CCP1CTS2>
extern volatile __bit                   CCP1CTS2            __at(0x1C7A);	// @ (0x38F * 8 + 2)
#define                                 CCP1CTS2_bit        _BIT_ACCESS(CCP1CAP,2)
// CCP1CAP<CCP1CTS3>
extern volatile __bit                   CCP1CTS3            __at(0x1C7B);	// @ (0x38F * 8 + 3)
#define                                 CCP1CTS3_bit        _BIT_ACCESS(CCP1CAP,3)
// CCP1CON<CCP1EN>
extern volatile __bit                   CCP1EN              __at(0x1C77);	// @ (0x38E * 8 + 7)
#define                                 CCP1EN_bit          _BIT_ACCESS(CCP1CON,7)
// CCP1CON<CCP1FMT>
extern volatile __bit                   CCP1FMT             __at(0x1C74);	// @ (0x38E * 8 + 4)
#define                                 CCP1FMT_bit         _BIT_ACCESS(CCP1CON,4)
// PIE2<CCP1IE>
extern volatile __bit                   CCP1IE              __at(0x4C2);	// @ (0x98 * 8 + 2)
#define                                 CCP1IE_bit          _BIT_ACCESS(PIE2,2)
// PIR2<CCP1IF>
extern volatile __bit                   CCP1IF              __at(0x472);	// @ (0x8E * 8 + 2)
#define                                 CCP1IF_bit          _BIT_ACCESS(PIR2,2)
// CCP1CON<CCP1MODE0>
extern volatile __bit                   CCP1MODE0           __at(0x1C70);	// @ (0x38E * 8 + 0)
#define                                 CCP1MODE0_bit       _BIT_ACCESS(CCP1CON,0)
// CCP1CON<CCP1MODE1>
extern volatile __bit                   CCP1MODE1           __at(0x1C71);	// @ (0x38E * 8 + 1)
#define                                 CCP1MODE1_bit       _BIT_ACCESS(CCP1CON,1)
// CCP1CON<CCP1MODE2>
extern volatile __bit                   CCP1MODE2           __at(0x1C72);	// @ (0x38E * 8 + 2)
#define                                 CCP1MODE2_bit       _BIT_ACCESS(CCP1CON,2)
// CCP1CON<CCP1MODE3>
extern volatile __bit                   CCP1MODE3           __at(0x1C73);	// @ (0x38E * 8 + 3)
#define                                 CCP1MODE3_bit       _BIT_ACCESS(CCP1CON,3)
// CCP1CON<CCP1OUT>
extern volatile __bit                   CCP1OUT             __at(0x1C75);	// @ (0x38E * 8 + 5)
#define                                 CCP1OUT_bit         _BIT_ACCESS(CCP1CON,5)
// CCP1PPS<CCP1PPS0>
extern volatile __bit                   CCP1PPS0            __at(0xF0F0);	// @ (0x1E1E * 8 + 0)
#define                                 CCP1PPS0_bit        _BIT_ACCESS(CCP1PPS,0)
// CCP1PPS<CCP1PPS1>
extern volatile __bit                   CCP1PPS1            __at(0xF0F1);	// @ (0x1E1E * 8 + 1)
#define                                 CCP1PPS1_bit        _BIT_ACCESS(CCP1PPS,1)
// CCP1PPS<CCP1PPS2>
extern volatile __bit                   CCP1PPS2            __at(0xF0F2);	// @ (0x1E1E * 8 + 2)
#define                                 CCP1PPS2_bit        _BIT_ACCESS(CCP1PPS,2)
// CCP1PPS<CCP1PPS3>
extern volatile __bit                   CCP1PPS3            __at(0xF0F3);	// @ (0x1E1E * 8 + 3)
#define                                 CCP1PPS3_bit        _BIT_ACCESS(CCP1PPS,3)
// CCP1PPS<CCP1PPS4>
extern volatile __bit                   CCP1PPS4            __at(0xF0F4);	// @ (0x1E1E * 8 + 4)
#define                                 CCP1PPS4_bit        _BIT_ACCESS(CCP1PPS,4)
// CCP1PPS<CCP1PPS5>
extern volatile __bit                   CCP1PPS5            __at(0xF0F5);	// @ (0x1E1E * 8 + 5)
#define                                 CCP1PPS5_bit        _BIT_ACCESS(CCP1PPS,5)
// CCP2CAP<CCP2CTS0>
extern volatile __bit                   CCP2CTS0            __at(0x1C98);	// @ (0x393 * 8 + 0)
#define                                 CCP2CTS0_bit        _BIT_ACCESS(CCP2CAP,0)
// CCP2CAP<CCP2CTS1>
extern volatile __bit                   CCP2CTS1            __at(0x1C99);	// @ (0x393 * 8 + 1)
#define                                 CCP2CTS1_bit        _BIT_ACCESS(CCP2CAP,1)
// CCP2CAP<CCP2CTS2>
extern volatile __bit                   CCP2CTS2            __at(0x1C9A);	// @ (0x393 * 8 + 2)
#define                                 CCP2CTS2_bit        _BIT_ACCESS(CCP2CAP,2)
// CCP2CAP<CCP2CTS3>
extern volatile __bit                   CCP2CTS3            __at(0x1C9B);	// @ (0x393 * 8 + 3)
#define                                 CCP2CTS3_bit        _BIT_ACCESS(CCP2CAP,3)
// CCP2CON<CCP2EN>
extern volatile __bit                   CCP2EN              __at(0x1C97);	// @ (0x392 * 8 + 7)
#define                                 CCP2EN_bit          _BIT_ACCESS(CCP2CON,7)
// CCP2CON<CCP2FMT>
extern volatile __bit                   CCP2FMT             __at(0x1C94);	// @ (0x392 * 8 + 4)
#define                                 CCP2FMT_bit         _BIT_ACCESS(CCP2CON,4)
// PIE2<CCP2IE>
extern volatile __bit                   CCP2IE              __at(0x4C3);	// @ (0x98 * 8 + 3)
#define                                 CCP2IE_bit          _BIT_ACCESS(PIE2,3)
// PIR2<CCP2IF>
extern volatile __bit                   CCP2IF              __at(0x473);	// @ (0x8E * 8 + 3)
#define                                 CCP2IF_bit          _BIT_ACCESS(PIR2,3)
// CCP2CON<CCP2MODE0>
extern volatile __bit                   CCP2MODE0           __at(0x1C90);	// @ (0x392 * 8 + 0)
#define                                 CCP2MODE0_bit       _BIT_ACCESS(CCP2CON,0)
// CCP2CON<CCP2MODE1>
extern volatile __bit                   CCP2MODE1           __at(0x1C91);	// @ (0x392 * 8 + 1)
#define                                 CCP2MODE1_bit       _BIT_ACCESS(CCP2CON,1)
// CCP2CON<CCP2MODE2>
extern volatile __bit                   CCP2MODE2           __at(0x1C92);	// @ (0x392 * 8 + 2)
#define                                 CCP2MODE2_bit       _BIT_ACCESS(CCP2CON,2)
// CCP2CON<CCP2MODE3>
extern volatile __bit                   CCP2MODE3           __at(0x1C93);	// @ (0x392 * 8 + 3)
#define                                 CCP2MODE3_bit       _BIT_ACCESS(CCP2CON,3)
// CCP2CON<CCP2OUT>
extern volatile __bit                   CCP2OUT             __at(0x1C95);	// @ (0x392 * 8 + 5)
#define                                 CCP2OUT_bit         _BIT_ACCESS(CCP2CON,5)
// CCP2PPS<CCP2PPS0>
extern volatile __bit                   CCP2PPS0            __at(0xF0F8);	// @ (0x1E1F * 8 + 0)
#define                                 CCP2PPS0_bit        _BIT_ACCESS(CCP2PPS,0)
// CCP2PPS<CCP2PPS1>
extern volatile __bit                   CCP2PPS1            __at(0xF0F9);	// @ (0x1E1F * 8 + 1)
#define                                 CCP2PPS1_bit        _BIT_ACCESS(CCP2PPS,1)
// CCP2PPS<CCP2PPS2>
extern volatile __bit                   CCP2PPS2            __at(0xF0FA);	// @ (0x1E1F * 8 + 2)
#define                                 CCP2PPS2_bit        _BIT_ACCESS(CCP2PPS,2)
// CCP2PPS<CCP2PPS3>
extern volatile __bit                   CCP2PPS3            __at(0xF0FB);	// @ (0x1E1F * 8 + 3)
#define                                 CCP2PPS3_bit        _BIT_ACCESS(CCP2PPS,3)
// CCP2PPS<CCP2PPS4>
extern volatile __bit                   CCP2PPS4            __at(0xF0FC);	// @ (0x1E1F * 8 + 4)
#define                                 CCP2PPS4_bit        _BIT_ACCESS(CCP2PPS,4)
// CCP2PPS<CCP2PPS5>
extern volatile __bit                   CCP2PPS5            __at(0xF0FD);	// @ (0x1E1F * 8 + 5)
#define                                 CCP2PPS5_bit        _BIT_ACCESS(CCP2PPS,5)
// FVRCON<CDAFVR0>
extern volatile __bit                   CDAFVR0             __at(0x8062);	// @ (0x100C * 8 + 2)
#define                                 CDAFVR0_bit         _BIT_ACCESS(FVRCON,2)
// FVRCON<CDAFVR1>
extern volatile __bit                   CDAFVR1             __at(0x8063);	// @ (0x100C * 8 + 3)
#define                                 CDAFVR1_bit         _BIT_ACCESS(FVRCON,3)
// ADCG1A<CGA0>
extern volatile __bit                   CGA0                __at(0xE970);	// @ (0x1D2E * 8 + 0)
#define                                 CGA0_bit            _BIT_ACCESS(ADCG1A,0)
// ADCG1A<CGA1>
extern volatile __bit                   CGA1                __at(0xE971);	// @ (0x1D2E * 8 + 1)
#define                                 CGA1_bit            _BIT_ACCESS(ADCG1A,1)
// ADCG1A<CGA2>
extern volatile __bit                   CGA2                __at(0xE972);	// @ (0x1D2E * 8 + 2)
#define                                 CGA2_bit            _BIT_ACCESS(ADCG1A,2)
// ADCG1A<CGA3>
extern volatile __bit                   CGA3                __at(0xE973);	// @ (0x1D2E * 8 + 3)
#define                                 CGA3_bit            _BIT_ACCESS(ADCG1A,3)
// ADCG1A<CGA4>
extern volatile __bit                   CGA4                __at(0xE974);	// @ (0x1D2E * 8 + 4)
#define                                 CGA4_bit            _BIT_ACCESS(ADCG1A,4)
// ADCG1A<CGA5>
extern volatile __bit                   CGA5                __at(0xE975);	// @ (0x1D2E * 8 + 5)
#define                                 CGA5_bit            _BIT_ACCESS(ADCG1A,5)
// ADCG1A<CGA6>
extern volatile __bit                   CGA6                __at(0xE976);	// @ (0x1D2E * 8 + 6)
#define                                 CGA6_bit            _BIT_ACCESS(ADCG1A,6)
// ADCG1A<CGA7>
extern volatile __bit                   CGA7                __at(0xE977);	// @ (0x1D2E * 8 + 7)
#define                                 CGA7_bit            _BIT_ACCESS(ADCG1A,7)
// ADCG1B<CGB0>
extern volatile __bit                   CGB0                __at(0xE978);	// @ (0x1D2F * 8 + 0)
#define                                 CGB0_bit            _BIT_ACCESS(ADCG1B,0)
// ADCG1B<CGB1>
extern volatile __bit                   CGB1                __at(0xE979);	// @ (0x1D2F * 8 + 1)
#define                                 CGB1_bit            _BIT_ACCESS(ADCG1B,1)
// ADCG1B<CGB2>
extern volatile __bit                   CGB2                __at(0xE97A);	// @ (0x1D2F * 8 + 2)
#define                                 CGB2_bit            _BIT_ACCESS(ADCG1B,2)
// ADCG1B<CGB3>
extern volatile __bit                   CGB3                __at(0xE97B);	// @ (0x1D2F * 8 + 3)
#define                                 CGB3_bit            _BIT_ACCESS(ADCG1B,3)
// ADCG1B<CGB4>
extern volatile __bit                   CGB4                __at(0xE97C);	// @ (0x1D2F * 8 + 4)
#define                                 CGB4_bit            _BIT_ACCESS(ADCG1B,4)
// ADCG1B<CGB5>
extern volatile __bit                   CGB5                __at(0xE97D);	// @ (0x1D2F * 8 + 5)
#define                                 CGB5_bit            _BIT_ACCESS(ADCG1B,5)
// ADCG1B<CGB6>
extern volatile __bit                   CGB6                __at(0xE97E);	// @ (0x1D2F * 8 + 6)
#define                                 CGB6_bit            _BIT_ACCESS(ADCG1B,6)
// ADCG1B<CGB7>
extern volatile __bit                   CGB7                __at(0xE97F);	// @ (0x1D2F * 8 + 7)
#define                                 CGB7_bit            _BIT_ACCESS(ADCG1B,7)
// ADCG1C<CGC0>
extern volatile __bit                   CGC0                __at(0xE980);	// @ (0x1D30 * 8 + 0)
#define                                 CGC0_bit            _BIT_ACCESS(ADCG1C,0)
// ADCG1C<CGC1>
extern volatile __bit                   CGC1                __at(0xE981);	// @ (0x1D30 * 8 + 1)
#define                                 CGC1_bit            _BIT_ACCESS(ADCG1C,1)
// ADCG1C<CGC2>
extern volatile __bit                   CGC2                __at(0xE982);	// @ (0x1D30 * 8 + 2)
#define                                 CGC2_bit            _BIT_ACCESS(ADCG1C,2)
// ADCG1C<CGC3>
extern volatile __bit                   CGC3                __at(0xE983);	// @ (0x1D30 * 8 + 3)
#define                                 CGC3_bit            _BIT_ACCESS(ADCG1C,3)
// ADCG1C<CGC4>
extern volatile __bit                   CGC4                __at(0xE984);	// @ (0x1D30 * 8 + 4)
#define                                 CGC4_bit            _BIT_ACCESS(ADCG1C,4)
// ADCG1C<CGC5>
extern volatile __bit                   CGC5                __at(0xE985);	// @ (0x1D30 * 8 + 5)
#define                                 CGC5_bit            _BIT_ACCESS(ADCG1C,5)
// ADCG1C<CGC6>
extern volatile __bit                   CGC6                __at(0xE986);	// @ (0x1D30 * 8 + 6)
#define                                 CGC6_bit            _BIT_ACCESS(ADCG1C,6)
// ADCG1C<CGC7>
extern volatile __bit                   CGC7                __at(0xE987);	// @ (0x1D30 * 8 + 7)
#define                                 CGC7_bit            _BIT_ACCESS(ADCG1C,7)
// ADCG1D<CGD0>
extern volatile __bit                   CGD0                __at(0xE988);	// @ (0x1D31 * 8 + 0)
#define                                 CGD0_bit            _BIT_ACCESS(ADCG1D,0)
// ADCG1D<CGD1>
extern volatile __bit                   CGD1                __at(0xE989);	// @ (0x1D31 * 8 + 1)
#define                                 CGD1_bit            _BIT_ACCESS(ADCG1D,1)
// ADCG1D<CGD2>
extern volatile __bit                   CGD2                __at(0xE98A);	// @ (0x1D31 * 8 + 2)
